NextFOAM-2407/tutorials/combustion/PDRFoam/pipeLattice/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probes
{
    type    probes;
    libs    (sampling);

    name    probes;

    writeControl   timeStep;
    writeInterval  1;

    fields
    (
        p
        b
        epsilon
        ft
        k
        rho
        St
        Su
        T
        U
        Xi
    );

    probeLocations
    (
        (2.     1.95    0.1)
        (2.     1.6     0.1)
        (2.     1.2     0.1)
        (2.     0.8     0.1)
        (2.     0.4     0.1)
        (2.     0.0     0.1)
        (2.8    2.8     0.1)
        (2      3.6     0.1)
        (2.     2.      0.9)
        (2.     2.      1.7)
        (2.     -0.2    0.1)
        (2.     -0.4    0.1)

        (2      2       0.1)
        (2.8    2       0.1)
        (3.6    2       0.1)
        (4.6    2       0.1)
        (5.6    2       0.1)
        (2      2.8     0.1)
        (2      3.6     0.1)
        (2      8.448   0.1)
        (2      5.6     0.1)
        (2      2       0.9)
        (2.8    2       0.9)
        (3.6    2       0.9)
        (4.6    2       0.9)
        (5.6    2       0.9)
        (2      2.8     0.9)
        (2      3.6     0.9)
        (2      8.448   0.9)
        (2      5.6     0.9)
        (2      2       1.9)
        (2.8    2       1.9)
        (3.6    2       1.9)
        (4.6    2       1.9)
        (5.6    2       1.9)
        (2      2.8     1.9)
        (2      3.6     1.9)
        (2      8.448   1.9)
        (2      5.6     1.9)
        (2      2       2.9)
        (2.8    2.8     0.1)
        (2.8    2.8     0.9)
        (2.8    2.8     1.9)
        (3.6    3.6     0.1)
        (3.6    3.6     0.9)
        (3.6    3.6     1.9)
    );
}


// ************************************************************************* //
